#include <stdio.h>
#include <stdlib.h>
#include "a3_1.h"
int main()
{
    int i=0;

    /****定义乱序数组****/
    int a[10]= {0,8,7,9,3,5,4,2,1,6};
    int b[11]={3,5,2,6,5,7,4,9,0,2,1};
    int c[12]={2,4,3,6,5,7,8,4,5,3,6,9};
    /****定义有序数组****/
    int d[12]={0,1,2,3,4,5,6,7,8,9,10,11};//升序
    int e[13]={12,11,10,9,8,7,6,5,4,3,2,1,0};//降序

//    bubble_sort(c,12); //冒泡排序
//    insert_sort(c, 12); //插入排序
//    select_sort(b, 11); //选择排序

/**顺序查找(1为升序0为降序)**/
//    i=seq_search(d, 12, 12, 1);
//    printf("该数是数组的第%d个元素\n",i);

/*********二分查找************/
//    i= bin_search(d, 12,12, 1);
//    printf("该数是数组的第%d个元素\n",i);

/******插入(原数组需有空位)******/
//    insertAt(c,12,9,12);//将数字插入数组
//    insert( e, 13, 9, 0);//将数字有序插入数组

/*******替换指定元素*******/
//    i=replace(c,12,10,66);
//    printf("返回值：%d\n",i);

/********拼接数组**********/
//  int *q=merge(d, 12, e, 13);
//  printf("数组首元素的地址为：%#X\n",q);

/******输出数组**********/
//    for(i=0; i<25 ; i++)
//        printf("%d  ",q[i]);

    return 0;
}
